monster: [5, 2], pos: [31069, 13842], select: 2, name: "稻妻8个点" -- 1 -> 8
monster: [5, 1], pos: [40646, 41646], name: "海祁岛东边2个点" -- 2 -> 10
monster: [5, 1], pos: [27945, 50965], name: "望泷村4个点" -- 3 -> 14
monster: [3, 3], pos: [36241, 42678], name: "星荧洞窟4个点" -- 4 -> 18
monster: [3, 3], pos: [29481, 33056], name: "无相之冰3个点" -- 5 -> 21
monster: [3, 3], pos: [23575, 31447], try: 2, name: "地中之盐" -- 5 -> 45
monster: [10, 3], pos: [57956, 41768], name: "盗宝团" -- 6 -> 51
monster: [3, 1], pos: [27279, 14691], select: 2, name: "绝云间" -- 7 -> 59
monster: [8, 2], pos: [45596, 31629], name: "镀金营地8个点" -- 7 -> 59
monster: [8, 2], pos: [44709, 20641], name: "往昔的桓纳兰那七天神像4个点" -- 8 -> 63
monster: [6, 3], pos: [7067, 58796], name: "二净甸神像6个点" -- 6 -> 51
monster: [8, 2], pos: [41943, 8105], narrow: 1, name: "鸡哥下面镀金营地11个点" -- 9 -> 74
monster: [9, 1], pos: [23848, 47869], select: 2, name: "水仙十字结社9个点" -- 11 -> 92
monster: [8, 3], pos: [44760, 21430], select: 2, name: "精石铜城4个点" -- 12 -> 96
monster: [8, 2], pos: [5463, 44196], name: "神的棋盘3个点" -- 13 -> 99
monster: [7, 3], pos: [35183, 14783], name: "秘仪圣殿28点" -- 14 -> 127
monster: [7, 3], pos: [35183, 14783], name: "秘仪圣殿28点" -- 14 -> 127
monster: [7, 3], pos: [35183, 14783], name: "秘仪圣殿28点" -- 14 -> 127
