monster: [4, 1], pos: [56812, 16968], name: "稻妻炮台6个点" -- 1 -> 6
monster: [5, 2], pos: [27450, 21582], name: "清赖岛28个点" -- 2 -> 34
monster: [5, 2], pos: [24275, 19943], name: "清赖岛28个点" -- 2 -> 34
monster: [3, 2], pos: [55361, 31842], name: "璃月帐篷3个点" -- 3 -> 37
monster: [2, 3], pos: [22482, 61984], name: "泸州老窖5个点" -- 4 -> 42
monster: [6, 3], pos: [26357, 28412], name: "无郁稠林3个点" -- 5 -> 45
monster: [6, 3], pos: [7067, 58796], name: "二净甸神像6个点" -- 6 -> 51
monster: [8, 2], pos: [45596, 31629], name: "镀金营地8个点" -- 7 -> 59
monster: [8, 2], pos: [44709, 20641], name: "往昔的桓纳兰那七天神像4个点" -- 8 -> 63
monster: [8, 2], pos: [41943, 8105], narrow: 1, name: "鸡哥下面镀金营地11个点" -- 9 -> 74
monster: [9, 2], pos: [56436, 8651], select: 2, name: "卡布迪斯堡9个点" -- 10 -> 83
monster: [9, 1], pos: [23848, 47869], select: 2, name: "水仙十字结社9个点" -- 11 -> 92
monster: [8, 3], pos: [44760, 21430], select: 2, name: "精石铜城4个点" -- 12 -> 96
monster: [8, 2], pos: [5463, 44196], name: "神的棋盘3个点" -- 13 -> 99
monster: [7, 3], pos: [35183, 14783], name: "秘仪圣殿28点" -- 14 -> 127
monster: [7, 3], pos: [35183, 14783], name: "秘仪圣殿28点" -- 14 -> 127
monster: [7, 3], pos: [35183, 14783], name: "秘仪圣殿28点" -- 14 -> 127
