; +6v2版本

global routes := [
    {monster: [2, 1], pos: [19412, 8471], name: "风龙废墟"}, ; 1
    {monster: [10, 3], pos: [54267, 26733], try: 2, name: "薄荷岛"}, ; 2
    {monster: [10, 3], pos: [46814, 47683], name: "奥藏山"}, ; 3
    {monster: [10, 3], pos: [57929, 41808], name: "庆中线"}, ; 4
    {monster: [10, 3], pos: [50681, 56336], select: 2, name: "庆中线"}, ; 5
    {monster: [10, 3], pos: [59517, 51736], name: "庆中线"}, ; 6
    {monster: [3, 2], pos: [34752, 20266], name: "泯林"}, ; 7
    {monster: [3, 2], pos: [28478, 25230], name: "南天门"}, ; 8
    {monster: [3, 2], pos: [25482, 12205], name: "琥牢山"}, ; 9
    {monster: [7, 1], pos: [54548, 24228], name: "地底线"}, ; 10
    {monster: [7, 1], pos: [31551, 35022], select: 2, qm: false, name: "鸡哥"}, ; 11
    {monster: [7, 1], pos: [46942, 62529], wheel: 4, name: "须弥雷神"}, ; 12
    {monster: [7, 1], pos: [39413, 60571], name: "营地"}, ; 13
    {monster: [7, 1], pos: [29041, 57838], qm: false, name: "往昔神像"}, ; 14
    {monster: [8, 2], pos: [45560, 31606], name: "善见地"}, ; 15
    {monster: [7, 1], pos: [20436, 58430]}, ; 16
    {monster: [8, 2], pos: [32473, 35022], select: 2}, ; 17
    {monster: [7, 1], pos: [14239, 38756]}, ; 18
    {monster: [7, 1], pos: [256, 36707]}, ; 19
    {monster: [7, 1], pos: [3252, 48730]}, ; 20
    {monster: [8, 2], pos: [7273, 20357]}, ; 21
    {monster: [8, 2], pos: [11832, 41671]}, ; 22
    {monster: [8, 2], pos: [21922, 64214]}, ; 23
    {monster: [7, 3], pos: [26813, 2915]}, ; 24
    {monster: [7, 3], pos: [30322, 19492]}, ; 25
    {monster: [8, 1], pos: [40591, 14756]}, ; 26
    {monster: [7, 2], pos: [22255, 35887]}, ; 27
    {monster: [7, 2], pos: [40719, 13617]}, ; 28
    {monster: [7, 2], pos: [41923, 2049]}, ; 29
    {monster: [3, 2], pos: [37646, 43720]}, ; 30
    {monster: [3, 2], pos: [42870, 63804]}, ; 31
    {monster: [3, 2], pos: [52628, 52419]}, ; 32
    {monster: [3, 3], pos: [29707, 50461]}, ; 33
    {monster: [3, 3], pos: [31321, 45360]}, ; 34
    {monster: [3, 3], pos: [23535, 31606], select: 2}, ; 35
    {monster: [3, 3], pos: [37825, 38119], select: 2}, ; 36
    {monster: [3, 3], pos: [43178, 45360]}, ; 37
    {monster: [3, 3], pos: [43178, 45360]}, ; 38
    {monster: [4, 3], pos: [27146, 43766]}, ; 39
    {monster: [4, 3], pos: [27786, 63804], wheel: 6}, ; 40
    {monster: [4, 1], pos: [57775, 7287]}, ; 41
    {monster: [4, 1], pos: [49196, 7150], wheel: 10}, ; 42
    {monster: [4, 1], pos: [51347, 30559], select: 2}, ; 43
    {monster: [4, 1], pos: [63256, 46999], select: 2}, ; 44
    {monster: [5, 3], pos: [31577, 26278]}, ; 45
    {monster: [5, 1], pos: [28017, 42673]}, ; 46
    {monster: [5, 1], pos: [23868, 44221]}, ; 47
    {monster: [10, 2], pos: [35627, 48992]}, ; 48
    {monster: [10, 2], pos: [35627, 48992]}, ; 49
    {monster: [10, 2], pos: [39143, 58250]}, ; 50
    {monster: [10, 2], pos: [34978, 59464], narrow: 1}, ; 51
    {monster: [9, 2], pos: [55941, 11747], select: 2}, ; 52
    {monster: [9, 1], pos: [42097, 44166]}, ; 53
    {monster: [9, 1], pos: [49915, 26408]}, ; 54
    {monster: [9, 3], pos: [44128, 14418]}, ; 55
    {monster: [6, 2], pos: [35985, 16027]}, ; 56
    {monster: [6, 2], pos: [36190, 30385]}, ; 57
    {monster: [6, 2], pos: [43736, 33906]}, ; 58
    {monster: [6, 2], pos: [47389, 19730]}, ; 59
    {monster: [6, 2], pos: [38939, 54456]}, ; 60
    {monster: [6, 2], pos: [48072, 43619]}, ; 61
    {monster: [6, 2], pos: [55105, 45289]}, ; 62
    {monster: [6, 2], pos: [49403, 57613], narrow: 1}, ; 63
    {monster: [6, 2], pos: [46416, 61801], select: 2}, ; 64
    {monster: [6, 2], pos: [26221, 45076]}, ; 65
    {monster: [6, 1], pos: [12137, 15784]}, ; 66
    {monster: [6, 1], pos: [19290, 12354]}, ; 67
    {monster: [6, 1], pos: [30403, 23828]}, ; 68
    {monster: [6, 1], pos: [52322, 14813]}, ; 69
    {monster: [6, 1], pos: [51247, 34513]}, ; 70
    {monster: [6, 1], pos: [28167, 60466], narrow: 1}, ; 71
    {monster: [6, 1], pos: [33237, 58554]}, ; 72
    {monster: [6, 1], pos: [25026, 54638]}, ; 73
    {monster: [6, 1], pos: [30198, 32176]}, ; 74
]
