global routes := [
    {monster: [6, 1], pos: [36, 903], movX: 400, name: "渊下宫1", pos2K: [120, 1195], movX2K: 600}, ; 1
    {monster: [6, 1], pos: [563, 202], name: "渊下宫2", pos2K: [753, 272]}, ; 2
    {monster: [6, 1], pos: [1536, 241], name: "渊下宫3", pos2K: [2045, 326]}, ; 3
    {monster: [6, 1], pos: [1500, 571], name: "渊下宫4", pos2K: [2004, 761]}, ; 4
    {monster: [6, 1], pos: [792, 1056], movY: -100, name: "渊下宫5", pos2K: [1059, 1296], movY2K: -200}, ; 5
    {monster: [6, 2], pos: [1053, 264], name: "层岩1", pos2K: [1405, 353]}, ; 6 -> 层岩
    {monster: [6, 2], pos: [1065, 498], pos2K: [1414, 666]}, ; 7
    {monster: [6, 2], pos: [1065, 498], pos2K: [1414, 666]}, ; 8
    {monster: [6, 2], pos: [1140, 899], pos2K: [1522, 1199]}, ; 9
    {monster: [6, 2], pos: [1216, 1048], movX: -400, movX2K: -300, pos2K: [1835, 1397]}, ; 10
    {monster: [10, 2], pos: [1044, 807], pos2K: [1391, 1077]}, ; 11 -> 枫丹
    {monster: [10, 2], pos: [1044, 807], pos2K: [1391, 1077]}, ; 12
    {monster: [10, 2], pos: [1147, 955], pos2K: [1528, 1279]}, ; 13
    {monster: [9, 2], pos: [1275, 265], pos2K: [1702, 354]}, ; 14
    {monster: [10, 3], pos: [683, 461], pos2K: [910, 613]}, ; 15
    {monster: [10, 3], pos: [961, 648], pos2K: [1285, 846]}, ; 16
    {monster: [10, 3], pos: [1590, 442], pos2K: [2119, 587]}, ; 17
    {monster: [7, 1], pos: [1315, 1019], wait: 100, pos2K: [1754, 1356]}, ; 18 -> 须弥鸡哥
    {monster: [7, 1], pos: [921, 579], select: 2, pos2K: [1232, 769]}, ; 19
    {monster: [7, 1], pos: [6, 605], pos2K: [11, 807]}, ; 20
    {monster: [7, 1], pos: [94, 800], pos2K: [124, 1070]}, ; 21
    {monster: [7, 1], pos: [851, 948], pos2K: [1134, 1270]}, ; 22
    {monster: [8, 1], pos: [1186, 242], pos2K: [1585, 324]}, ; 23
    {monster: [7, 2], pos: [650, 593], pos2K: [869, 788]}, ; 24
    {monster: [7, 2], pos: [1190, 223], pos2K: [1590, 299]}, ; 25
    {monster: [7, 2], pos: [1229, 32], pos2K: [1637, 45]}, ; 26
    {monster: [4, 3], pos: [793, 720], pos2K: [1060, 961]}, ; 27
    {monster: [4, 1], pos: [1504, 503], select: 2, pos2K: [2004, 672]}, ; 28
    {monster: [5, 2], pos: [954, 597], pos2K: [1272, 794]}, ; 29
    ; 带传奇
    {monster: [9, 1], pos: [1460, 430], pos2K: [1949, 577]}, ; 30
    {monster: [10, 3], pos: [1195, 420], pos2K: [1592, 562]}, ; 31 龙蜥
]
