global routes := [
    {monster: [4, 3], pos: [793, 721], name: "刀车1", pos2K: [971, 396], pos4K: [1460, 598]}, ; 1
    {monster: [4, 3], pos: [672, 890], name: "刀车2", pos2K: [899, 1191], pos4K: [1349, 1787]}, ; 2
    {monster: [4, 2], pos: [1129, 717], name: "刀车3", pos2K: [1509, 961], pos4K: [2263, 1440]}, ; 3
    {monster: [4, 2], pos: [1129, 717], name: "刀车4", pos2K: [1509, 961], pos4K: [2263, 1440]}, ; 4
    {monster: [4, 2], pos: [994, 618], name: "刀车5", pos2K: [1327, 825], pos4K: [1990, 1235]}, ; 5
    {monster: [4, 1], pos: [1558, 264], name: "刀车6", pos2K: [2077, 349], pos4K: [1999, 1728]}, ; 6
    {monster: [4, 1], pos: [1558, 264], name: "刀车7", pos2K: [2077, 349], pos4K: [1999, 1728]}, ; 7
    {monster: [4, 1], pos: [1717, 409], select: 2, name: "刀车8", pos2K: [2290, 548], pos4K: [2314, 2021]}, ; 8
    {monster: [4, 1], pos: [1788, 476], narrow: -1, name: "刀车9", pos2K: [2066, 655], pos4K: [3105, 986]}, ; 9
    {monster: [4, 1], pos: [1412, 321], name: "刀车10", pos2K: [1885, 431], pos4K: [2825, 650]}, ; 10
    {monster: [4, 1], pos: [1090, 269], name: "刀车11", pos2K: [1452, 362], pos4K: [2180, 540]}, ; 11
    {monster: [4, 1], pos: [875, 377], name: "刀车12", pos2K: [1166, 502], pos4K: [1753, 752]}, ; 12
    {monster: [4, 1], pos: [875, 377], name: "刀车13", pos2K: [1166, 502], pos4K: [1753, 752]}, ; 13
    {monster: [4, 1], pos: [978, 429], name: "刀车14", pos2K: [1304, 573], pos4K: [1953, 857]}, ; 14
    {monster: [4, 1], pos: [850, 587], name: "刀车15", pos2K: [1176, 772], pos4K: [1763, 1121], narrow: -1}, ; 15
    {monster: [4, 1], pos: [994, 661], name: "刀车16", pos2K: [1327, 887], pos4K: [1993, 1322]}, ; 16
    {monster: [5, 2], pos: [711, 329], name: "刀车17", pos2K: [951, 439], pos4K: [1424, 659]}, ; 17
    {monster: [5, 2], pos: [1080, 254], name: "刀车18", pos2K: [1444, 340], pos4K: [2162, 513]}, ; 18
    {monster: [5, 2], pos: [1080, 254], name: "刀车19", pos2K: [1444, 340]}, ; 19
;    {monster: [5, 2], pos: [895, 442], name: "刀车19", pos2K: [1195, 596], pos4K: [1792, 891]}, ; 19 （其余点）
    {monster: [5, 2], pos: [1102, 449], name: "刀车20", pos2K: [1474, 603], pos4K: [2209, 897]}, ; 19 （温迪点）
    {monster: [5, 2], pos: [1102, 449], name: "刀车21", pos2K: [1474, 603], pos4K: [2209, 897]}, ; 20
]
