global routes := [
    {monster: [7, 1], pos: [36746, 48954]}, ; 1
    {monster: [7, 1], pos: [41766, 53205]}, ; 2
    {monster: [5, 1], pos: [28106, 32980]}, ; 3
    {monster: [5, 1], pos: [23871, 44034]}, ; 4
    {monster: [5, 1], pos: [23871, 44034]}, ; 5
    {monster: [5, 1], pos: [28003, 42455]}, ; 6
    {monster: [5, 1], pos: [35653, 55149], narrow: -1}, ; 7
    {monster: [5, 1], pos: [40708, 41544]}, ; 8
    {monster: [5, 2], pos: [24281, 19982]}, ; 9 -> 雷音
    {monster: [5, 2], pos: [31077, 19618]}, ; 10
    {monster: [5, 2], pos: [31077, 13848], try: 2}, ; 11
    {monster: [5, 2], pos: [37736, 27332]}, ; 12
    {monster: [5, 2], pos: [32477, 36017]}, ; 13
    {monster: [5, 3], pos: [30701, 34741], narrow: -1}, ; 14 -> 土狗
    {monster: [6, 1], pos: [5396, 46281], narrow: 3}, ; 15 -> 渊下宫
    {monster: [6, 1], pos: [19671, 35410], drag: [34151, 4859, 34151, 53448], narrow: 3}, ; 16; 16
    {monster: [6, 1], pos: [52353, 1093], narrow: 2}, ; 17
    {monster: [6, 1], pos: [49211, 23809]}, ; 18
    {monster: [6, 1], pos: [37736, 24113], drag: [34151, 54663, 34151, 6074], narrow: 3}, ; 19
]
