global routes := [
 ;   {monster: [8, 3], pos: [33468, 39297]}, ;1 加餐起点
    {monster: [8, 2], pos: [30053, 1761]}, ;2
    {monster: [7, 1], pos: [21208, 37171]}, ;3  限时锚点
    {monster: [7, 1], pos: [29096, 57821]}, ;4
    {monster: [7, 1], pos: [20320, 58732], try: 2}, ;5
    {monster: [7, 1], pos: [16461, 55453]}, ;6
    {monster: [8, 2], pos: [32102, 38082], narrow: -2}, ;7
    {monster: [8, 2], pos: [27867, 49683]}, ;8
    {monster: [8, 2], pos: [18202, 45674]}, ;9
    {monster: [8, 2], pos: [10621, 62620]}, ;10
    {monster: [8, 2], pos: [8060, 65110], select: 2}, ;11
    {monster: [8, 2], pos: [0, 24659]}, ;12
    {monster: [8, 3], pos: [38215, 40754]}, ;13
    {monster: [8, 3], pos: [52250, 24659]}, ;14
    {monster: [8, 3], pos: [48665, 17189], try: 2}, ;15
    {monster: [10, 2], pos: [35585, 49015]}, ;16
    {monster: [4, 1], pos: [33399, 25874]}, ;17
]
