global routes := [
    {monster: [5, 1], pos: [35619, 55149], narrow: -1}, ;1
    {monster: [3, 3], pos: [47469, 23444], narrow: -1}, ;2
    {monster: [3, 3], pos: [39478, 28668]}, ;3
    {monster: [3, 3], pos: [31077, 62255]}, ;4
    {monster: [3, 1], pos: [43337, 29457]}, ;5
    {monster: [3, 1], pos: [25579, 41362]}, ;6
    {monster: [3, 1], pos: [30838, 61344]}, ;7
    {monster: [6, 3], pos: [26433, 28303]}, ;8
    {monster: [6, 3], pos: [17144, 33648]}, ;9
    {monster: [8, 2], pos: [65467, 35410]}, ;10
    {monster: [8, 2], pos: [45591, 31765]}, ;11
 ;   {monster: [8, 2], pos: [39615, 12087]}, ;12没有沙丘锚点走路点位
    {monster: [7, 1], pos: [22574, 35652]}, ;12限时锚点
    {monster: [8, 2], pos: [29848, 1701]}, ;13
    {monster: [8, 2], pos: [7206, 19800]}, ;14
    {monster: [8, 2], pos: [18236, 45553]}, ;15
    {monster: [8, 2], pos: [18236, 45553]}, ;16
    {monster: [7, 3], pos: [16665, 5891]}, ;17
    {monster: [8, 3], pos: [38078, 25267]}, ;18
    {monster: [9, 2], pos: [16256, 17067]}, ;19
    {monster: [4, 3], pos: [30770, 48104], narrow: -1}, ;20
    {monster: [4, 3], pos: [30087, 49015], select: 2}, ;21
    {monster: [5, 2], pos: [31077, 19679]}, ;22
    {monster: [5, 2], pos: [24247, 19922]}, ;23
    {monster: [5, 2], pos: [24247, 19922]}, ;24
    {monster: [4, 2], pos: [29062, 56303]}, ;22
    {monster: [5, 1], pos: [40708, 41665]}, ;23
    {monster: [5, 1], pos: [27969, 33102]}, ;24
]